[{"source":"鲁迅《野草》","text":"绝望之为虚妄，正与希望相同。"},{"source":"纪晓岚《阅微草堂笔记》","text":"物之反常者为妖。"},{"source":"村上春树","text":"人们习惯了求而不得，最终连自己原本想要什么都忘却了。"},{"original":"Ideas can be killed. With better ideas.","source":"qntm <em>antimemetics-division-hub</em>","text":"理念是杀得死的，用更好的理念。","license":"CC BY-SA 3.0"},{"original":"如今人方为刀俎，我为鱼肉，何辞为。","source":"樊哙（自 司马迁《史记》）","text":"人为刀俎，我为鱼肉。"},{"original":"All models are wrong, but some are useful.","source":"George E. P. Box","text":"所有的模型都是错的，只不过有的更有用一些。"},{"source":"Oliver Burkeman <em>Four Thousand Weeks: Time Management for Mortals</em>（《四千周》）","text":"无限是神的专利，人生因有限而重要。"},{"original":"That is not dead which can eternal lie, and with strange aeons even death may die.","source":"H.P. 洛夫克拉夫特（Howard Phillips Lovecraft）","text":"那长眠的不朽者未必永恒死去，在那奇迹的移涌中，纵然死亡本身，亦将消逝。"},{"original":"And if this finds you too late, and your time is also passing, please send this message on, so the next voice can speak against the darkness.","source":"scp-1281","text":"当你们的时代过去，请继续送出信息，好让下一个声音响起来对抗黑暗。","license":"CC BY-SA 3.0"},{"source":"Dylan Thomas <em>Do not go gentle into that good night</em>","text":"不要温和地走进那个良夜。"},{"source":"<a href='https://www.bilibili.com/video/BV16g411Y76G/'>《生而为人，我很兴奋》</a>","text":"我们掌握这么精妙的语言，却还是满嘴苍白拙劣的谎言；<br>我们痴迷记录亿年的文明，却抹去了那么多刻骨铭心的故事；<br>我们不断反思过去的悲剧，却还是逃不掉重蹈历史的覆辙；<br>我们成天联想远在天边的美好，却总听不到近在咫尺的哭声；<br>我们抬笔写下多少传世佳作，却还是描不出现实的抽象与魔幻。"},{"original":"To the time to life, rather than to life in time.","source":"Blaise Pascal","text":"给时光以生命，而不是给生命以时光。"},{"source":"Immanuel Kant","text":"每个人都是依据他在世界上的使命拟定自己的计划。他想精熟某些技艺，想藉此得到某些荣耀和平安，想要在脚踏实地的人生里得到长久的幸福，无数的欢乐与愿景，构成了神奇的灯笼上面缤纷的图饰，在他的想象里展开；结束这场光影游戏的死亡，在黑暗的远方招手，但是欢乐的世界的光线遮蔽且扭曲了它。我们活在自己的梦境里，真实的命运却为我们铺了一条完全不同的道路。冥冥中的安排与我们自己的想象完全不一样，我们每踏出充满希望的脚步，紧跟而来的便是失望…直到看似遥远的死亡，突然结束这一场游戏。"},{"source":"William of Occam 奥卡姆剃刀（Occam's Razor，Ockham's Razor）","text":"如无必要，勿增实体。"},{"source":"<a href='https://space.bilibili.com/193147738'>幻海航行@bilibili</a>","text":"我们的征途是星辰大海，也是字里行间，所有的故事，不过是人生的隐喻。"},{"source":"《论语·里仁第四》","text":"朝闻道，夕死可矣。"},{"source":"马丁·海德格尔","text":"一朵花的美丽在于她曾经凋谢过，向死而生的意义在于：当你无限接近死亡，才能深切体会生的含义。"},{"source":"陶渊明《时运》","text":"有风自南，翼彼新苗。"},{"source":"刘义庆《世说新语》","text":"夜光之珠，不必出于孟津之河；盈握之璧，不必采于昆仑之山。"},{"source":"顾城《一代人》","text":"黑夜给了我黑色的眼睛，我却用它寻找光明。"},{"source":"Albert Einstein","text":"The eternal mystery of the universe is its comprehensibility."},{"source":"唐珙《题龙阳县青草湖》","text":"满船清梦压星河。"},{"source":"《项脊轩志》","text":"庭有枇杷树，吾妻死之年所手植也，今已亭亭如盖矣。"},{"original":"Let life be beautiful like summer flowers, and death like autumn leaves.","source":"泰戈尔《飞鸟集》（郑振铎译）","text":"生如夏花之绚烂，死如秋叶之静美。"},{"source":"《资治通鉴》","text":"春燕归，巢于林木。"},{"source":"《圣女贞德》","text":"面对愚昧，神们自己也缄口不言。"},{"source":"王国维《人间词话》","text":"以我观物，故物皆著我之色彩。"},{"text":"一个时代结束的标志就是它开始被浪漫化。"},{"source":"《百年孤独》","text":"让一让，母牛们，生命短暂啊！"},{"source":"《娱乐至死》","text":"任何公共领域的内容都日渐以娱乐的方式出现，人类悄无声息地成为娱乐的附庸，其结果是我们成了一个娱乐至死的物种。"},{"source":"《狂人日记》","text":"你们可以改了，从真心改起！要晓得将来容不得吃人的人，活在世上。"},{"source":"Kahlil Gibran <em>Sand and Foam</em>","text":"Seven times have I despised my soul:<br>The first time when I saw her being meek that she might attain height.<br>The second time when I saw her limping before the crippled.<br>The third time when she was given to choose between the hard and the easy, and she chose the easy.<br>The fourth time when she committed a wrong, and comforted herself that others also commit wrong.<br>The fifth time when she forbore for weakness, and attributed her patience to strength.<br>The sixth time when she despised the ugliness of a face, and knew not that it was one of her own masks.<br>And the seventh time when she sang a song of praise, and deemed it a virtue."},{"source":"白居易《问刘十九》","text":"绿蚁新醅酒，红泥小火炉。"},{"source":"马克思墓志铭","text":"The philosophers have only interpreted the world in various ways - the point however is to change it."},{"source":"原句似乎来自歌词，之后经过网民的不断迭代，有数个版本","text":"世人慌慌张张，不过图碎银几两。偏这碎银几两，能解世间惆怅，保父母晚年安康，稚子入得学堂，你我柴米油盐五粮。偏这碎银几两，压弯世人脊梁，看清人心险恶和善良。可转念一想，百年阳寿殆尽，难逃黄土里躺。世事大梦一场，人生几度秋凉。不如土里一躺，不用慌慌张张，可是回头一想，想躺，还得碎银几两。"},{"source":"张岱《自为墓志铭》","text":"欲进余以千秋之业，岂料余之一事无成也哉！"},{"source":"《资治通鉴》、《三国志》、《宋史》、《辽史》、《明史》、《清史稿》等","text":"人/民相食。"},{"source":"屈原《离骚》","text":"路漫漫其修远兮，吾将上下而求索。"},{"source":"《荀子》","text":"天行有常，不为尧存，不为桀亡。"},{"source":"《世说新语·言语》","text":"木犹如此，人何以堪。"},{"source":"茨威格","text":"所有命运馈赠的礼物，早已在暗中标好了价格。"},{"source":"《论语·子罕》（9·23）","text":"后生可畏，焉知来者之不如今也。"},{"source":"史铁生","text":"就命运而言，休论公道。"},{"source":"Albert Schweitzer","text":"无论如何，你看到的总是自己。死在路上的甲虫，它是像你一样为了生存而奋斗的生命，像你一样喜欢太阳，像你一样懂得害怕和痛苦，现在，它却成了腐烂的肌体，就像你今后也会如此。"},{"source":"Baruch de Spinoza <em>Die Ethik</em>（斯宾诺莎《伦理学》）","text":"嘲笑、轻蔑、愤怒、报复……这些情绪，都与恨有关或者含有因恨而起的成分，不能成为善。<br>……<br>希望和失望也绝不能是善。因为恐惧是一种痛苦，希望不能脱离恐惧而存在，所以希望和失望都表示知识的缺乏，和心灵的软弱无力。"},{"original":"Wir müssen wissen. Wir werden wissen.","source":"David Hilbert（希尔伯特）墓志铭","text":"我们必须知道，我们必将知道。"},{"source":"Linus Torvalds","text":"Talk is cheap, show me the code."},{"source":"唐太宗（自《旧唐书·魏徵传》）","text":"夫以铜为镜，可以正衣冠；以史为镜，可以知兴替；以人为镜，可以明得失。"},{"original":"The amazing thing is that every atom in your body came from a star that exploded. And, the atoms in your left hand probably came from a different star than your right hand. It really is the most poetic thing I know about physics: You are all stardust. You couldn’t be here if stars hadn't exploded, because the elements - the carbon, nitrogen, oxygen, iron, all the things that matter for evolution - weren't created at the beginning of time. They were created in the nuclear furnaces of stars, and the only way they could get into your body is if those stars were kind enough to explode. So, forget Jesus. The stars died so that you could be here today.","source":"Lawrence M. Krauss","text":"我们都是星尘。"},{"source":"老子《道德经》","text":"天地不仁，以万物为刍狗。"},{"source":"William Shakespare <em>Hamlet</em>","text":"I could be bounded in a nutshell and count myself a king of infinite space."},{"source":"Karen Horney 《我们时代的神经症人格》","text":"通过沉浸于痛苦来获得满足，体现了这样一种普遍原则，即通过让自己迷失在某种更巨大的东西中，通过消解自己的个性，通过放弃自我以及它所拥有的一切怀疑、冲突、痛苦、局限和孤独，来获得满足。"},{"source":"《金刚经》（鸠摩罗什译）","text":"一切有为法，如梦幻泡影，如露亦如电，应作如是观。"},{"original":"Nun sage ich: der Mensch und überhaupt jedes vernünftige<br>Wesen existiert als Zweck an sich selbst, nicht bloß als Mittel zum<br>beliebigen Gebrauche für diesen oder jenen Willen, sondern muß<br>in allen seinen sowohl auf sich selbst, als auch auf andere vernünftige<br>Wesen gerichteten Handlungen jederzeit zugleich als Zweck betrachtet werden.","source":"康德《实践理性批判》","text":"人是目的，不是手段。"},{"text":"Ad Astra Per Aspera"},{"source":"<a href='https://www.zhihu.com/question/41098497'>2016 万人续作</a>","text":"我有一壶酒，足以慰风尘。尽倾江海里，赠饮天下人。"},{"source":"梁启超《饮冰室文集》","text":"十年饮冰，难凉热血。"},{"source":"《圣经·传道书》","text":"已有的事后必再有；已行的事后必再行。日光之下并无新事。"},{"source":"莎士比亚《暴风雨》","text":"凡所过往，皆为序章。"},{"source":"王阳明","text":"此心光明，亦复何言？"},{"source":"梭罗","text":"I went to the woods because I wished to live deliberately, to front only the essential facts of life, and see if I could not learn what it had to teach, and not, when I came to die, discover that I had not lived."},{"source":"《红楼梦》","text":"无可云证，是立足境。无立足境，是方干净。"}]