class Milfoil {
	name
	count
	constructor(n, c) {
		this.name = n
		this.count = c
	}
	remove(num) {
		this.count -= num
	}
	divide(name, num) {
		this.count -= num
		return new Milfoil(name, num)
	}
	randomly_divide(name) {
		let num = Math.floor(Math.random() * (this.count - 1)) + 1
		return this.divide(name, num)
	}
	rename(name) {
		this.name = name
	}
	rem_to_pool(mil) {
		let rem = this.count & 3
		if (rem == 0) rem = 4
		mil.count += rem
		this.count -= rem
	}
	merge(mil) {
		this.count += mil.count
	}
}

function run_divination() {
	let manifestation = []
	let mil = new Milfoil("源蓍草", 50)
	mil.remove(1)
	for (let i = 0; i < 6; i++) {
		manifestation.push(getbit(mil) - 6)
	}
	// ["老阴", "少阳", "少阴", "老阳"]
	let line_change_count = 0
	let hexagram_original = []
	let hexagram_changed = []
	let changed = []
	let unchanged = []
	for (let i in manifestation) {
		x = manifestation[i]
		let isyang = (x == 1 || x == 3)
		let ispolar = (x == 0 || x == 3)
		if (ispolar) {
			line_change_count += 1
			changed.push(i)
		}
		else unchanged.push(i)
		hexagram_original.push(isyang)
		hexagram_changed.push(x == 0 || x == 1)
	}
	// ;
	let p = document.getElementById("result")
	p.innerText = get_divination_word(line_change_count,
		hexagram_original, hexagram_changed,
		changed, unchanged)
}
function getbit(mil) {
	// 一变
	let mil2 = mil.randomly_divide("地")
	mil.rename("天")
	let mil3 = mil2.divide("人", 1)
	mil3.rename("余")
	mil.rem_to_pool(mil3)
	mil2.rem_to_pool(mil3)
	mil.merge(mil2)
	// 二变
	mil2 = mil.randomly_divide("地")
	mil.rem_to_pool(mil3)
	mil2.rem_to_pool(mil3)
	mil.merge(mil2)
	// 三变
	mil2 = mil.randomly_divide("地")
	mil.rem_to_pool(mil3)
	mil2.rem_to_pool(mil3)
	mil.merge(mil2)
	// ;
	let res = mil.count >> 2
	mil.merge(mil3)
	return res
}

const words = [ // https://ctext.org/book-of-changes/yi-jing/zhs?en=off
	/* 0 */ {
		name: "坤",
		i: "元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞，吉。",
		ii: ["履霜，坚冰至。",
			"直，方，大，不习无不利。",
			"含章可贞。或从王事，无成有终。",
			"括囊；无咎，无誉。",
			"黄裳，元吉。",
			"龙战于野，其血玄黄。",
			// 用六：利永贞。
		],
	},
	/* 1 */ {
		name: "颐",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 2 */ {
		name: "师",
		i: "贞，丈人，吉无咎。",
		ii: ["师出以律，否臧凶。",
			"在师中吉，无咎，王三锡命。",
			"师或舆尸，凶。",
			"师左次，无咎。",
			"田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
			"大君有命，开国承家，小人勿用。"],
	},
	/* 3 */ {
		name: "临",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 4 */ {
		name: "谦",
		i: "亨，君子有终。",
		ii: ["谦谦君子，用涉大川，吉。",
			"鸣谦，贞吉。",
			"劳谦，君子有终，吉。",
			"无不利，撝谦。",
			"不富，以其邻，利用侵伐，无不利。",
			"鸣谦，利用行师，征邑国。"],
	},
	/* 5 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 6 */ {
		name: "升",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 7 */ {
		name: "泰",
		i: "小往大来，吉亨。",
		ii: ["拔茅茹，以其汇，征吉。",
			"包荒，用冯河，不遐遗，朋亡，得尚于中行。",
			"无平不陂，无往不复，艰贞无咎。勿恤其孚，于食有福。",
			"翩翩，不富，以其邻，不戒以孚。",
			"帝乙归妹，以祉元吉。",
			"城复于隍，勿用师。自邑告命，贞吝。"],
	},
	/* 8 */ {
		name: "豫",
		i: "利建侯，行师。",
		ii: ["鸣豫，凶。",
			"介于石，不终日，贞吉。",
			"盱豫，悔。迟有悔。",
			"由豫，大有得。勿疑。朋盍簪。",
			"贞疾，恒不死。",
			"冥豫，成有渝，无咎。"],
	},
	/* 9 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 10 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 11 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 12 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 13 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 14 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 15 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 16 */ {
		name: "比",
		i: "吉。原筮元永贞，无咎。不宁方来，后夫凶。",
		ii: ["有孚，比之，无咎。有孚盈缶，终来有它吉。",
			"比之自内，贞吉。",
			"比之匪人。",
			"外比之，贞吉。",
			"显比，王用三驱，失前禽。邑人不诫，吉。",
			"比之无首，凶。"],
	},
	/* 17 */ {
		name: "屯",
		i: "元亨，利贞，勿用有攸往，利建侯。",
		ii: ["磐桓；利居贞，利建侯。",
			"屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。",
			"即鹿无虞，惟入于林中，君子几不如舍，往吝。",
			"乘马班如，求婚媾，往吉，无不利。",
			"屯其膏，小贞吉，大贞凶。",
			"乘马班如，泣血涟如。"],
	},
	/* 18 */ {
		name: "坎",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 19 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 20 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 21 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 22 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 23 */ {
		name: "需",
		i: "有孚，光亨，贞吉。利涉大川。",
		ii: ["需于郊。利用恒，无咎。",
			"需于沙。小有言，终吉。",
			"需于泥，致寇至。",
			"需于血，出自穴。",
			"需于酒食，贞吉。",
			"入于穴，有不速之客三人来，敬之终吉。"],
	},
	/* 24 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 25 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 26 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 27 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 28 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 29 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 30 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 31 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 32 */ {
		name: "剥",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 33 */ {
		name: "复",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 34 */ {
		name: "蒙",
		i: "亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
		ii: ["发蒙，利用刑人，用说桎梏，以往吝。",
			"包蒙吉；纳妇吉；子克家。",
			"勿用取女；见金夫，不有躬，无攸利。",
			"困蒙，吝。",
			"童蒙，吉。",
			"击蒙；不利为寇，利御寇。"],
	},
	/* 35 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 36 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 37 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 38 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 39 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 40 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 41 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 42 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 43 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 44 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 45 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 46 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 47 */ {
		name: "大有",
		i: "元亨。",
		ii: ["无交害，匪咎，艰则无咎。",
			"大车以载，有攸往，无咎。",
			"公用亨于天子，小人弗克。",
			"匪其彭，无咎。",
			"厥孚交如，威如；吉。",
			"自天佑之，吉无不利。"],
	},
	/* 48 */ {
		name: "观",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 49 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 50 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 51 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 52 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 53 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 54 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 55 */ {
		name: "小畜",
		i: "亨。密云不雨，自我西郊。",
		ii: ["复自道，何其咎，吉。",
			"牵复，吉。",
			"舆说辐，夫妻反目。",
			"有孚，血去惕出，无咎。",
			"有孚挛如，富以其邻。",
			"既雨既处，尚德载，妇贞厉。月几望，君子征凶。"],
	},
	/* 56 */ {
		name: "否",
		i: "否之匪人，不利君子贞，大往小来。",
		ii: ["拔茅茹，以其汇，贞吉亨。",
			"包承。小人吉，大人否，亨。",
			"包羞。",
			"有命，无咎，畴离祉。",
			"休否，大人吉。其亡其亡，系于苞桑。",
			"倾否，先否后喜。"],
	},
	/* 57 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 58 */ {
		name: "讼",
		i: "有孚，窒。惕中吉。终凶。利见大人，不利涉大川。",
		ii: ["不永所事，小有言，终吉。",
			"不克讼，归而逋，其邑人三百户，无眚。",
			"食旧德，贞厉，终吉，或从王事，无成。",
			"不克讼，复即命渝，安贞吉。",
			"讼元吉。",
			"或锡之鞶带，终朝三褫之。"],
	},
	/* 59 */ {
		name: "履",
		i: "履虎尾，不咥人，亨。",
		ii: ["素履，往无咎。",
			"履道坦坦，幽人贞吉。",
			"履道坦坦，幽人贞吉。",
			"眇能视，跛能履，履虎尾，咥人，凶。武人为于大君。",
			"履虎尾，诉诉，终吉。",
			"视履考祥，其旋元吉。"],
	},
	/* 60 */ {
		name: "",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 61 */ {
		name: "同人",
		i: "同人于野，亨。利涉大川，利君子贞。",
		ii: ["同人于门，无咎。",
			"同人于宗，吝。",
			"伏戎于莽，升其高陵，三岁不兴。",
			"乘其墉，弗克攻，吉。",
			"同人，先号啕而后笑。大师克相遇。",
			"同人于郊，无悔。"],
	},
	/* 62 */ {
		name: "姤",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 63 */ {
		name: "乾",
		i: "元亨，利贞",
		ii: ["潜龙，勿用。",
			"见龙在田，利见大人。",
			"君子终日乾乾，夕惕若厉，无咎。",
			"或跃在渊，无咎。",
			"飞龙在天，利见大人。",
			"亢龙有悔。",
			// 用九：见群龙无首，吉。
		],
	},
]

function ii_tag(i, isyang){
	return isyang ?
		["初九", "九二", "九三", "九四", "九五", "上九"][i] :
		["初六", "六二", "六三", "六四", "六五", "上六"][i]
}
function get_divination_word(c, ori, cha, cd, ucd) {
	let main = ""
	let assist = ""
	let int1 = ori[0] | ori[1] << 1 | ori[2] << 2 | ori[3] << 3 | ori[4] << 4 | ori[5] << 5
	let int2 = cha[0] | cha[1] << 1 | cha[2] << 2 | cha[3] << 3 | cha[4] << 4 | cha[5] << 5
	let w1 = words[int1]
	let w2 = words[int2]
	switch (c) {
		case 0: // 本卦卦辞
			main = `【${w1.name}】${w1.i}`
			break
		case 1: // 本卦变爻爻辞
			main = `【${w1.name}·${ii_tag(cd[0], ori[cd[0]])}】${w1.ii[cd[0]]}`
			break
		case 2: // 本卦变爻爻辞，以上爻爻词为主
			main = `【${w1.name}·${ii_tag(cd[1], ori[cd[1]])}】${w1.ii[cd[1]]}`
			assist = `【${w1.name}·${ii_tag(cd[0], ori[cd[0]])}】${w1.ii[cd[0]]}`
			break
		case 3: // 本卦卦词为主，之卦卦词为辅
			main = `【${w1.name}】${w1.i}`
			assist = `【${w2.name}】${w2.i}`
			break
		case 4: // 本卦未变爻爻词，以下爻爻词为主
			main = `【${w1.name}·${ii_tag(ucd[0], ori[ucd[0]])}】${w1.ii[ucd[0]]}`
			assist = `【${w1.name}·${ii_tag(ucd[1], ori[ucd[1]])}】${w1.ii[ucd[1]]}`
			break
		case 5: // 之卦未变爻爻词
			main = `【${w2.name}·${ii_tag(ucd[0], cha[ucd[0]])}】${w2.ii[ucd[0]]}`
			break
		case 6: // 之卦卦词
			main = `【${w2.name}】${w2.i}`
			break
		default:
			break
	}
	if (assist == "") return main
	else return `主：${main}\n辅：${assist}`
}
