class Milfoil {
	name
	count
	constructor(n, c) {
		this.name = n
		this.count = c
	}
	remove(num) {
		this.count -= num
	}
	divide(name, num) {
		this.count -= num
		return new Milfoil(name, num)
	}
	randomly_divide(name) {
		let num = Math.floor(Math.random() * (this.count - 1)) + 1
		return this.divide(name, num)
	}
	rename(name) {
		this.name = name
	}
	rem_to_pool(mil) {
		let rem = this.count & 3
		if (rem == 0) rem = 4
		mil.count += rem
		this.count -= rem
	}
	merge(mil) {
		this.count += mil.count
	}
}

function run_divination() {
	let manifestation = []
	let mil = new Milfoil("源蓍草", 50)
	mil.remove(1)
	for (let i = 0; i < 6; i++) {
		manifestation.push(getbit(mil) - 6)
	}
	// ["老阴", "少阳", "少阴", "老阳"]
	let line_change_count = 0
	let hexagram_original = []
	let hexagram_changed = []
	let changed = []
	let unchanged = []
	for (let i in manifestation) {
		x = manifestation[i]
		let isyang = (x == 1 || x == 3)
		let ispolar = (x == 0 || x == 3)
		if (ispolar) {
			line_change_count += 1
			changed.push(i)
		}
		else unchanged.push(i)
		hexagram_original.push(isyang)
		hexagram_changed.push(x == 0 || x == 1)
	}
	// ;
	let p = document.getElementById("result")
	p.innerText = get_divination_word(line_change_count,
		hexagram_original, hexagram_changed,
		changed, unchanged)
}
function getbit(mil) {
	// 一变
	let mil2 = mil.randomly_divide("地")
	mil.rename("天")
	let mil3 = mil2.divide("人", 1)
	mil3.rename("余")
	mil.rem_to_pool(mil3)
	mil2.rem_to_pool(mil3)
	mil.merge(mil2)
	// 二变
	mil2 = mil.randomly_divide("地")
	mil.rem_to_pool(mil3)
	mil2.rem_to_pool(mil3)
	mil.merge(mil2)
	// 三变
	mil2 = mil.randomly_divide("地")
	mil.rem_to_pool(mil3)
	mil2.rem_to_pool(mil3)
	mil.merge(mil2)
	// ;
	let res = mil.count >> 2
	mil.merge(mil3)
	return res
}

const words = [ // https://ctext.org/book-of-changes/yi-jing/zhs?en=off
	/* 0 */ {
		name: "坤",
		i: "元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞，吉。",
		ii: ["履霜，坚冰至。",
			"直，方，大，不习无不利。",
			"含章可贞。或从王事，无成有终。",
			"括囊；无咎，无誉。",
			"黄裳，元吉。",
			"龙战于野，其血玄黄。",
			// 用六：利永贞。
		],
	},
	/* 1 */ {
		name: "复",
		i: "亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。",
		ii: ["不远复，无祗悔，元吉。",
			"休复，吉。",
			"频复，厉无咎。",
			"中行独复。",
			"敦复，无悔。",
			"迷复，凶，有灾眚。用行师，终有大败，以其国君，凶；至于十年，不克征。"],
	},
	/* 2 */ {
		name: "师",
		i: "贞，丈人，吉无咎。",
		ii: ["师出以律，否臧凶。",
			"在师中吉，无咎，王三锡命。",
			"师或舆尸，凶。",
			"师左次，无咎。",
			"田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
			"大君有命，开国承家，小人勿用。"],
	},
	/* 3 */ {
		name: "临",
		i: "元，亨，利，贞。至于八月有凶。",
		ii: ["咸临，贞吉。",
			"咸临，吉无不利。",
			"甘临，无攸利。既忧之，无咎。",
			"至临，无咎。",
			"知临，大君之宜，吉。",
			"敦临，吉无咎。"],
	},
	/* 4 */ {
		name: "谦",
		i: "亨，君子有终。",
		ii: ["谦谦君子，用涉大川，吉。",
			"鸣谦，贞吉。",
			"劳谦，君子有终，吉。",
			"无不利，撝谦。",
			"不富，以其邻，利用侵伐，无不利。",
			"鸣谦，利用行师，征邑国。"],
	},
	/* 5 */ {
		name: "明夷",
		i: "利艰贞。",
		ii: ["明夷于飞，垂其翼。君子于行，三日不食，有攸往，主人有言。",
			"明夷，夷于左股，用拯马壮，吉。",
			"明夷于南狩，得其大首，不可疾贞。",
			"入于左腹，获明夷之心，出于门庭。",
			"箕子之明夷，利贞。",
			"不明晦，初登于天，后入于地。"],
	},
	/* 6 */ {
		name: "升",
		i: "元亨，用见大人，勿恤，南征吉。",
		ii: ["允升，大吉。",
			"孚乃利用禴，无咎。",
			"升虚邑。",
			"王用亨于岐山，吉无咎。",
			"贞吉，升阶。",
			"冥升，利于不息之贞。"],
	},
	/* 7 */ {
		name: "泰",
		i: "小往大来，吉亨。",
		ii: ["拔茅茹，以其汇，征吉。",
			"包荒，用冯河，不遐遗，朋亡，得尚于中行。",
			"无平不陂，无往不复，艰贞无咎。勿恤其孚，于食有福。",
			"翩翩，不富，以其邻，不戒以孚。",
			"帝乙归妹，以祉元吉。",
			"城复于隍，勿用师。自邑告命，贞吝。"],
	},
	/* 8 */ {
		name: "豫",
		i: "利建侯，行师。",
		ii: ["鸣豫，凶。",
			"介于石，不终日，贞吉。",
			"盱豫，悔。迟有悔。",
			"由豫，大有得。勿疑。朋盍簪。",
			"贞疾，恒不死。",
			"冥豫，成有渝，无咎。"],
	},
	/* 9 */ {
		name: "震",
		i: "亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。",
		ii: ["震来虩虩，后笑言哑哑，吉。",
			"震来厉，亿丧贝，跻于九陵，勿逐，七日得。",
			"震苏苏，震行无眚。",
			"震遂泥。",
			"震往来厉，亿无丧，有事。",
			"震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。"],
	},
	/* 10 */ {
		name: "解",
		i: "利西南，无所往，其来复吉。有攸往，夙吉。",
		ii: ["无咎。",
			"田获三狐，得黄矢，贞吉。",
			"负且乘，致寇至，贞吝。",
			"解而拇，朋至斯孚。",
			"君子维有解，吉；有孚于小人。",
			"公用射隼于高墉之上，获之，无不利。"],
	},
	/* 11 */ {
		name: "归妹",
		i: "征凶，无攸利。",
		ii: ["归妹以娣，跛能履，征吉。",
			"眇能视，利幽人之贞。",
			"归妹以须，反归以娣。",
			"归妹愆期，迟归有时。",
			"帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。",
			"女承筐无实，士刲羊无血，无攸利。"],
	},
	/* 12 */ {
		name: "小过",
		i: "亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上，宜下，大吉。",
		ii: ["飞鸟以凶。",
			"过其祖，遇其妣；不及其君，遇其臣；无咎。",
			"弗过防之，从或戕之，凶。",
			"无咎，弗过遇之。往厉必戒，勿用永贞。",
			"密云不雨，自我西郊，公弋取彼在穴。",
			"弗遇过之，飞鸟离之，凶，是谓灾眚。"],
	},
	/* 13 */ {
		name: "丰",
		i: "亨，王假之，勿忧，宜日中。",
		ii: ["遇其配主，虽旬无咎，往有尚。",
			"丰其蔀，日中见斗，往得疑疾，有孚发若，吉。",
			"丰其沛，日中见沬，折其右肱，无咎。",
			"丰其蔀，日中见斗，遇其夷主，吉。",
			"来章，有庆誉，吉。",
			"丰其屋，蔀其家，闚其户，阒其无人，三岁不觌，凶。"],
	},
	/* 14 */ {
		name: "恒",
		i: "亨，无咎，利贞，利有攸往。",
		ii: ["浚恒，贞凶，无攸利。",
			"悔亡。",
			"不恒其德，或承之羞，贞吝。",
			"田无禽。",
			"恒其德，贞，妇人吉，夫子凶。",
			"振恒，凶。"],
	},
	/* 15 */ {
		name: "大壮",
		i: "利贞。",
		ii: ["壮于趾，征凶，有孚。",
			"贞吉。",
			"小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。",
			"贞吉悔亡，藩决不羸，壮于大舆之輹。",
			"丧羊于易，无悔。",
			"羝羊触藩，不能退，不能遂，无攸利，艰则吉。"],
	},
	/* 16 */ {
		name: "比",
		i: "吉。原筮元永贞，无咎。不宁方来，后夫凶。",
		ii: ["有孚，比之，无咎。有孚盈缶，终来有它吉。",
			"比之自内，贞吉。",
			"比之匪人。",
			"外比之，贞吉。",
			"显比，王用三驱，失前禽。邑人不诫，吉。",
			"比之无首，凶。"],
	},
	/* 17 */ {
		name: "屯",
		i: "元亨，利贞，勿用有攸往，利建侯。",
		ii: ["磐桓；利居贞，利建侯。",
			"屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。",
			"即鹿无虞，惟入于林中，君子几不如舍，往吝。",
			"乘马班如，求婚媾，往吉，无不利。",
			"屯其膏，小贞吉，大贞凶。",
			"乘马班如，泣血涟如。"],
	},
	/* 18 */ {
		name: "坎",
		i: "习坎，有孚，维心亨，行有尚。",
		ii: ["习坎，入于坎窞，凶。",
			"坎有险，求小得。",
			"来之坎坎，险且枕，入于坎窞，勿用。",
			"樽酒簋贰，用缶，纳约自牖，终无咎。",
			"坎不盈，祗既平，无咎。",
			"系用徽纆，置于丛棘，三岁不得，凶。"],
	},
	/* 19 */ {
		name: "节",
		i: "亨。苦节，不可贞。",
		ii: [
			"不出户庭，无咎。",
			"不出门庭，凶。",
			"不节若，则嗟若，无咎。",
			"安节，亨。",
			"甘节，吉；往有尚。",
			"苦节，贞凶，悔亡。"],
	},
	/* 20 */ {
		name: "蹇",
		i: "利西南，不利东北；利见大人，贞吉。",
		ii: ["往蹇，来誉。",
			"王臣蹇蹇，匪躬之故。",
			"往蹇来反。",
			"往蹇来连。",
			"大蹇朋来。",
			"往蹇来硕，吉；利见大人。"],
	},
	/* 21 */ {
		name: "既济",
		i: "亨，小利贞，初吉终乱。",
		ii: ["曳其轮，濡其尾，无咎。",
			"妇丧其茀，勿逐，七日得。",
			"高宗伐鬼方，三年克之，小人勿用。",
			"繻有衣袽，终日戒。",
			"东邻杀牛，不如西邻之禴祭，实受其福。",
			"濡其首，厉。"],
	},
	/* 22 */ {
		name: "井",
		i: "改邑不改井，无丧无得，往来井井。汔至，亦未繘井，羸其瓶，凶。",
		ii: ["井泥不食，旧井无禽。",
			"井谷射鲋，瓮敝漏。",
			"井渫不食，为我心恻，可用汲，王明，并受其福。",
			"井甃，无咎。",
			"井冽，寒泉食。",
			"井收勿幕，有孚元吉。"],
	},
	/* 23 */ {
		name: "需",
		i: "有孚，光亨，贞吉。利涉大川。",
		ii: ["需于郊。利用恒，无咎。",
			"需于沙。小有言，终吉。",
			"需于泥，致寇至。",
			"需于血，出自穴。",
			"需于酒食，贞吉。",
			"入于穴，有不速之客三人来，敬之终吉。"],
	},
	/* 24 */ {
		name: "萃",
		i: "亨。王假有庙，利见大人，亨，利贞。用大牲吉，利有攸往。",
		ii: ["有孚不终，乃乱乃萃，若号一握为笑，勿恤，往无咎。",
			"引吉，无咎，孚乃利用禴。",
			"萃如，嗟如，无攸利，往无咎，小吝。",
			"大吉，无咎。",
			"萃有位，无咎。匪孚，元永贞，悔亡。",
			"赍咨涕洟，无咎。"],
	},
	/* 25 */ {
		name: "随",
		i: "元亨利贞，无咎。",
		ii: ["官有渝，贞吉。出门交有功。",
			"系小子，失丈夫。",
			"系丈夫，失小子。随有求得，利居贞。",
			"随有获，贞凶。有孚在道，以明，何咎。",
			"孚于嘉，吉。",
			"拘系之，乃从维之。王用亨于西山。"],
	},
	/* 26 */ {
		name: "困",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 27 */ {
		name: "兑",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 28 */ {
		name: "咸",
		i: "亨，利贞，取女吉。",
		ii: ["咸其拇。",
			"咸其腓，凶，居吉。",
			"咸其股，执其随，往吝。",
			"贞吉，悔亡，憧憧往来，朋从尔思。",
			"咸其脢，无悔。",
			"咸其辅颊舌。"],
	},
	/* 29 */ {
		name: "革",
		i: "巳日乃孚，元亨利贞，悔亡。",
		ii: ["巩用黄牛之革。",
			"巳日乃革之，征吉，无咎。",
			"征凶，贞厉，革言三就，有孚。",
			"悔亡，有孚改命，吉。",
			"大人虎变，未占有孚。",
			"君子豹变，小人革面，征凶，居贞吉。"],
	},
	/* 30 */ {
		name: "大过",
		i: "栋桡，利有攸往，亨。",
		ii: ["藉用白茅，无咎。",
			"枯杨生稊，老夫得其女妻，无不利。",
			"栋桡，凶。",
			"栋隆，吉；有它吝。",
			"枯杨生华，老妇得士夫，无咎无誉。",
			"过涉灭顶，凶，无咎。"],
	},
	/* 31 */ {
		name: "夬",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 32 */ {
		name: "剥",
		i: "不利有攸往。",
		ii: ["剥床以足，蔑贞凶。",
			"剥床以辨，蔑贞凶。",
			"剥之，无咎。",
			"剥床以肤，凶。",
			"贯鱼，以宫人宠，无不利。",
			"硕果不食，君子得舆，小人剥庐。"],
	},
	/* 33 */ {
		name: "颐",
		i: "贞吉。观颐，自求口实。",
		ii: ["舍尔灵龟，观我朵颐，凶。",
			"颠颐，拂经，于丘颐，征凶。",
			"拂颐，贞凶，十年勿用，无攸利。",
			"颠颐，吉，虎视眈眈，其欲逐逐，无咎。",
			"拂经，居贞吉，不可涉大川。",
			"由颐，厉吉，利涉大川。"],
	},
	/* 34 */ {
		name: "蒙",
		i: "亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
		ii: ["发蒙，利用刑人，用说桎梏，以往吝。",
			"包蒙吉；纳妇吉；子克家。",
			"勿用取女；见金夫，不有躬，无攸利。",
			"困蒙，吝。",
			"童蒙，吉。",
			"击蒙；不利为寇，利御寇。"],
	},
	/* 35 */ {
		name: "损",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 36 */ {
		name: "艮",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 37 */ {
		name: "贲",
		i: "亨。小利有攸往。",
		ii: ["贲其趾，舍车而徒。",
			"贲其须。",
			"贲如濡如，永贞吉。",
			"贲如皤如，白马翰如，匪寇婚媾。",
			"贲于丘园，束帛戋戋，吝，终吉。",
			"白贲，无咎。"],
	},
	/* 38 */ {
		name: "蛊",
		i: "元亨，利涉大川。先甲三日，后甲三日。",
		ii: ["干父之蛊，有子，考无咎，厉终吉。",
			"干母之蛊，不可贞。",
			"干父之蛊，小有悔，无大咎。",
			"裕父之蛊，往见吝。",
			"干父之蛊，用誉。",
			"不事王侯，高尚其事。"],
	},
	/* 39 */ {
		name: "大畜",
		i: "利贞，不家食吉，利涉大川。",
		ii: ["有厉利已。",
			"舆说輹。",
			"良马逐，利艰贞。曰闲舆卫，利有攸往。",
			"童牛之牿，元吉。",
			"豶豕之牙，吉。",
			"何天之衢，亨。"],
	},
	/* 40 */ {
		name: "艮",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 41 */ {
		name: "噬嗑",
		i: "亨。利用狱。",
		ii: ["屦校灭趾，无咎。",
			"噬肤灭鼻，无咎。",
			"噬腊肉，遇毒；小吝，无咎。",
			"噬乾胏，得金矢，利艰贞，吉。",
			"噬乾肉，得黄金，贞厉，无咎。",
			"何校灭耳，凶。"],
	},
	/* 42 */ {
		name: "未济",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 43 */ {
		name: "睽",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 44 */ {
		name: "旅",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 45 */ {
		name: "离",
		i: "利贞，亨。畜牝牛，吉。",
		ii: ["履错然，敬之无咎。",
			"黄离，元吉。",
			"日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
			"突如其来如，焚如，死如，弃如。",
			"出涕沱若，戚嗟若，吉。",
			"王用出征，有嘉折首，获匪其丑，无咎。"],
	},
	/* 46 */ {
		name: "鼎",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 47 */ {
		name: "大有",
		i: "元亨。",
		ii: ["无交害，匪咎，艰则无咎。",
			"大车以载，有攸往，无咎。",
			"公用亨于天子，小人弗克。",
			"匪其彭，无咎。",
			"厥孚交如，威如；吉。",
			"自天佑之，吉无不利。"],
	},
	/* 48 */ {
		name: "观",
		i: "盥而不荐，有孚顒若。",
		ii: ["童观，小人无咎，君子吝。",
			"闚观，利女贞。",
			"观我生，进退。",
			"观国之光，利用宾于王。",
			"观我生，君子无咎。",
			"观其生，君子无咎。"],
	},
	/* 49 */ {
		name: "益",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 50 */ {
		name: "涣",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 51 */ {
		name: "中孚",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 52 */ {
		name: "渐",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 53 */ {
		name: "家人",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 54 */ {
		name: "巽",
		i: "",
		ii: ["",
			"",
			"",
			"",
			"",
			""],
	},
	/* 55 */ {
		name: "小畜",
		i: "亨。密云不雨，自我西郊。",
		ii: ["复自道，何其咎，吉。",
			"牵复，吉。",
			"舆说辐，夫妻反目。",
			"有孚，血去惕出，无咎。",
			"有孚挛如，富以其邻。",
			"既雨既处，尚德载，妇贞厉。月几望，君子征凶。"],
	},
	/* 56 */ {
		name: "否",
		i: "否之匪人，不利君子贞，大往小来。",
		ii: ["拔茅茹，以其汇，贞吉亨。",
			"包承。小人吉，大人否，亨。",
			"包羞。",
			"有命，无咎，畴离祉。",
			"休否，大人吉。其亡其亡，系于苞桑。",
			"倾否，先否后喜。"],
	},
	/* 57 */ {
		name: "无妄",
		i: "元亨，利贞。其匪正有眚，不利有攸往。",
		ii: ["无妄，往吉。",
			"不耕获，不灾畲，则利有攸往。",
			"无妄之灾，或系之牛，行人之得，邑人之灾。",
			"可贞，无咎。",
			"无妄之疾，勿药有喜。",
			"无妄，行有眚，无攸利。"],
	},
	/* 58 */ {
		name: "讼",
		i: "有孚，窒。惕中吉。终凶。利见大人，不利涉大川。",
		ii: ["不永所事，小有言，终吉。",
			"不克讼，归而逋，其邑人三百户，无眚。",
			"食旧德，贞厉，终吉，或从王事，无成。",
			"不克讼，复即命渝，安贞吉。",
			"讼元吉。",
			"或锡之鞶带，终朝三褫之。"],
	},
	/* 59 */ {
		name: "履",
		i: "履虎尾，不咥人，亨。",
		ii: ["素履，往无咎。",
			"履道坦坦，幽人贞吉。",
			"眇能视，跛能履，履虎尾，咥人，凶。武人为于大君。",
			"履虎尾，诉诉，终吉。",
			"夬履，贞厉。",
			"视履考祥，其旋元吉。"],
	},
	/* 60 */ {
		name: "遯",
		i: "亨，小利贞。",
		ii: ["遯尾，厉，勿用有攸往。",
			"执之用黄牛之革，莫之胜说。",
			"系遯，有疾厉，畜臣妾吉。",
			"好遯，君子吉，小人否。",
			"嘉遯，贞吉。",
			"肥遯，无不利。"],
	},
	/* 61 */ {
		name: "同人",
		i: "同人于野，亨。利涉大川，利君子贞。",
		ii: ["同人于门，无咎。",
			"同人于宗，吝。",
			"伏戎于莽，升其高陵，三岁不兴。",
			"乘其墉，弗克攻，吉。",
			"同人，先号啕而后笑。大师克相遇。",
			"同人于郊，无悔。"],
	},
	/* 62 */ {
		name: "姤",
		i: "女壮，勿用取女。",
		ii: ["系于金柅，贞吉，有攸往，见凶，羸豕孚蹢躅。",
			"包有鱼，无咎，不利宾。",
			"臀无肤，其行次且，厉，无大咎。",
			"包无鱼，起凶。",
			"以杞包瓜，含章，有陨自天。",
			"姤其角，吝，无咎。"],
	},
	/* 63 */ {
		name: "乾",
		i: "元亨，利贞",
		ii: ["潜龙，勿用。",
			"见龙在田，利见大人。",
			"君子终日乾乾，夕惕若厉，无咎。",
			"或跃在渊，无咎。",
			"飞龙在天，利见大人。",
			"亢龙有悔。",
			// 用九：见群龙无首，吉。
		],
	},
]

function ii_tag(i, isyang) {
	return isyang ?
		["初九", "九二", "九三", "九四", "九五", "上九"][i] :
		["初六", "六二", "六三", "六四", "六五", "上六"][i]
}
function get_divination_word(c, ori, cha, cd, ucd) {
	let main = ""
	let assist = ""
	let int1 = ori[0] | ori[1] << 1 | ori[2] << 2 | ori[3] << 3 | ori[4] << 4 | ori[5] << 5
	let int2 = cha[0] | cha[1] << 1 | cha[2] << 2 | cha[3] << 3 | cha[4] << 4 | cha[5] << 5
	let w1 = words[int1]
	let w2 = words[int2]
	switch (c) {
		case 0: // 本卦卦辞
			main = `【${w1.name}】${w1.i}`
			break
		case 1: // 本卦变爻爻辞
			main = `【${w1.name}·${ii_tag(cd[0], ori[cd[0]])}】${w1.ii[cd[0]]}`
			break
		case 2: // 本卦变爻爻辞，以上爻爻词为主
			main = `【${w1.name}·${ii_tag(cd[1], ori[cd[1]])}】${w1.ii[cd[1]]}`
			assist = `【${w1.name}·${ii_tag(cd[0], ori[cd[0]])}】${w1.ii[cd[0]]}`
			break
		case 3: // 本卦卦词为主，之卦卦词为辅
			main = `【${w1.name}】${w1.i}`
			assist = `【${w2.name}】${w2.i}`
			break
		case 4: // 本卦未变爻爻词，以下爻爻词为主
			main = `【${w1.name}·${ii_tag(ucd[0], ori[ucd[0]])}】${w1.ii[ucd[0]]}`
			assist = `【${w1.name}·${ii_tag(ucd[1], ori[ucd[1]])}】${w1.ii[ucd[1]]}`
			break
		case 5: // 之卦未变爻爻词
			main = `【${w2.name}·${ii_tag(ucd[0], cha[ucd[0]])}】${w2.ii[ucd[0]]}`
			break
		case 6: // 之卦卦词
			main = `【${w2.name}】${w2.i}`
			break
		default:
			break
	}
	if (assist == "") return main
	else return `主：${main}\n辅：${assist}`
}
